{
  "chapter": 8,
  "stages": [
    {
      "stageId": 1,
      "title": "システム開発の流れ",
      "subtitle": "ソフトウェアはどんな順番で作るの？",
      "category": "マネジメント系",
      "subcategory": "システム開発技術",
      "estimatedMinutes": 15,
      "mainQuestion": {
        "source": "令和5年 問42",
        "originalText": "ソフトウェア開発プロセスにおいて，ソフトウェア要件定義で明確にするものはどれか。",
        "choices": {
          "ア": "開発するソフトウェアの品質についての，利用者の要求をまとめたもの",
          "イ": "ソフトウェアの各機能を実現するための，プログラム構造やデータ構造",
          "ウ": "ソフトウェアを構成するプログラムごとの，処理手順",
          "エ": "利用者が必要とする機能や性能などのソフトウェアに対する要求をまとめたもの"
        },
        "answer": "エ",
        "wordExplanations": [
          {
            "word": "要件定義",
            "reading": "ようけんていぎ",
            "explanation": "システムに「何が必要か」を決めるステップのこと。お客さんの「こんなものが欲しい！」を整理してまとめるんだよ。"
          },
          {
            "word": "ソフトウェア開発プロセス",
            "reading": "ソフトウェアかいはつプロセス",
            "explanation": "ソフトウェアを作るときの手順や流れのこと。要件定義→設計→プログラミング→テスト→運用という流れがあるよ。"
          },
          {
            "word": "プログラム構造",
            "reading": "プログラムこうぞう",
            "explanation": "プログラムをどのように組み立てるかという設計のこと。ソフトウェア詳細設計の段階で決めるよ。"
          }
        ],
        "questionExplained": "この問題は「ソフトウェアの要件定義では何を決めるの？」を聞いているよ。\n\nソフトウェアを作るときは、いきなりプログラムを書き始めるのではなく、まず「何を作るか」をしっかり決めるんだ。お客さんが求めている機能や性能をまとめるのが要件定義だよ。",
        "choiceAnalysis": [
          {
            "choice": "ア",
            "verdict": "✗",
            "explanation": "品質の要求も大切だけど、ソフトウェア要件定義は品質だけでなく「機能や性能など全体の要求」をまとめるもの。これだと範囲が狭すぎるよ。"
          },
          {
            "choice": "イ",
            "verdict": "✗",
            "explanation": "プログラム構造やデータ構造を決めるのは「ソフトウェア詳細設計」の仕事。要件定義の段階ではまだ早いよ。"
          },
          {
            "choice": "ウ",
            "verdict": "✗",
            "explanation": "プログラムの処理手順を決めるのは「プログラミング（実装）」に近い段階。要件定義ではそこまで細かく決めないよ。"
          },
          {
            "choice": "エ",
            "verdict": "◎ 正解",
            "explanation": "利用者が求める機能や性能をまとめるのが、まさにソフトウェア要件定義の役割！「何を作るか」を明確にするんだね。"
          }
        ],
        "solvingStrategy": {
          "steps": [
            "「要件定義」は開発の一番最初のステップであることを思い出す",
            "要件定義＝「何が必要か」をまとめること。設計やプログラミングはその後のステップ",
            "「利用者が求めるもの」をまとめる内容の選択肢を探そう"
          ],
          "trap": "「プログラム構造」や「処理手順」は設計やプログラミングの段階で決めること。要件定義では「何を作るか」だけを決めて、「どう作るか」はまだ決めないよ。"
        }
      },
      "relatedKnowledge": {
        "title": "システム開発の流れを覚えよう",
        "content": [
          {
            "term": "ウォーターフォールモデル",
            "description": "滝の水が上から下へ流れるように、要件定義→設計→実装→テスト→運用の順番に一つずつ進める開発手法。前の工程に戻りにくいのが特徴だよ。"
          },
          {
            "term": "要件定義",
            "description": "お客さんの「こんなシステムが欲しい！」という要望を整理して、システムに必要な機能や性能を明確にする最初の工程。ここがしっかりしていないと、後で大変なことになるよ。"
          },
          {
            "term": "設計",
            "description": "要件定義で決めた内容をもとに、システムの仕組みを具体的に決める工程。外部設計（画面や帳票）と内部設計（プログラムの構造）があるよ。"
          },
          {
            "term": "プロトタイピング",
            "description": "早い段階で試作品（プロトタイプ）を作って、お客さんに見せて確認してもらう開発手法。「思っていたのと違う！」を早めに防げるんだ。"
          },
          {
            "term": "スパイラルモデル",
            "description": "システムを小さな部分に分けて、設計→実装→テスト→評価のサイクルを繰り返しながら大きくしていく開発手法。らせん（スパイラル）のように回りながら進むイメージだよ。"
          },
          {
            "term": "DevOps（デブオプス）",
            "description": "開発チーム（Dev）と運用チーム（Ops）が協力して、素早くシステムを改善していく考え方。開発と運用の壁をなくして、スムーズに連携するんだよ。"
          }
        ]
      },
      "practiceQuestions": [
        {
          "source": "令和4年 問44",
          "questionText": "ソフトウェアの開発モデルの一つであるウォーターフォールモデルの記述として，最も適切なものはどれか。",
          "choices": {
            "ア": "開発するソフトウェアを独立性の高い幾つかの部分に分割し，その部分ごとに設計，プログラミング，テストの工程を繰り返しながら完成させていく。",
            "イ": "開発の早い段階で，目に見えるプロトタイプ（試作品）を作成し，ユーザの要求を明確にしながら開発を進める。",
            "ウ": "前の工程が完了してから次の工程に進むことを基本としており，手戻りが生じた場合の影響が大きい。",
            "エ": "利用者からの要求が明確になっていない場合にも適用しやすく，初回のリリースまでの期間が短い。"
          },
          "answer": "ウ",
          "shortExplanation": "ウォーターフォール（滝）のように上から下へ一方通行で進む開発モデル。前の工程に戻りにくく、もし戻ると影響が大きいんだよ。",
          "questionExplained": "この問題は「ウォーターフォールモデルってどんな特徴の開発方法？」を聞いているよ。\n\nウォーターフォール＝「滝」という意味で、滝の水が上から下に流れるように、要件定義→設計→実装→テストと順番に進めていくんだ。一度進んだら前に戻りにくいのが大きな特徴だよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "これはスパイラルモデルの説明だよ。部分ごとに繰り返して開発するのがスパイラルモデルだね。"},
            {"choice": "イ", "verdict": "✗", "explanation": "これはプロトタイピングモデルの説明だよ。試作品を作って確認するやり方だね。"},
            {"choice": "ウ", "verdict": "◎ 正解", "explanation": "ウォーターフォールモデルは順番に進めるから、前の工程に戻ると大きな手戻りになるよ！"},
            {"choice": "エ", "verdict": "✗", "explanation": "これはアジャイル開発に近い説明だよ。ウォーターフォールは要求が明確でないと使いにくいんだ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "ウォーターフォール＝「滝」→ 上から下へ一方通行",
              "「順番に進む」「前に戻りにくい」がキーワード",
              "各選択肢がどの開発モデルの特徴かを考えてみよう"
            ],
            "trap": "アやエのように「繰り返し」「素早い」といった特徴は、スパイラルモデルやアジャイル開発のもの。ウォーターフォールは順番通りに一つずつ進めるモデルだよ。"
          }
        },
        {
          "source": "令和6年 問45",
          "questionText": "システム開発プロジェクトにおけるV字モデルの説明として，最も適切なものはどれか。",
          "choices": {
            "ア": "開発工程の各段階とテスト工程の各段階を対応付けたモデルである。",
            "イ": "システムを部分に分けて，設計・実装・テストのサイクルを繰り返すモデルである。",
            "ウ": "要件定義から運用までを一方向に進めるモデルである。",
            "エ": "利用者の要求を早い段階で確認するために，試作品を作るモデルである。"
          },
          "answer": "ア",
          "shortExplanation": "V字モデルは、左側に開発工程（要件定義→設計→実装）、右側に対応するテスト工程（単体テスト→結合テスト→システムテスト）を配置したモデルだよ。",
          "questionExplained": "この問題は「V字モデルとはどんな開発モデル？」を聞いているよ。\n\nV字モデルは「V」の形で開発の流れを表すもの。左側に開発工程、右側にテスト工程を並べて、どのテストがどの開発工程に対応するかをわかりやすくしているんだ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "◎ 正解", "explanation": "V字モデルは開発工程とテスト工程を対応付けるのが最大の特徴！要件定義には受入れテスト、設計には結合テストが対応するよ。"},
            {"choice": "イ", "verdict": "✗", "explanation": "これはスパイラルモデルの説明だよ。繰り返し開発するモデルだね。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "これはウォーターフォールモデルの説明だよ。V字モデルとは違う特徴だよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "これはプロトタイピングモデルの説明だよ。試作品を作るモデルだね。"}
          ],
          "solvingStrategy": {
            "steps": [
              "V字モデルの「V」の形をイメージする → 左が開発工程、右がテスト工程",
              "V字モデルの特徴は「開発とテストの対応付け」",
              "開発工程とテスト工程をセットにした内容の選択肢を見つけよう"
            ],
            "trap": "ウォーターフォールモデルも順番に進むけど、V字モデルは特に「開発とテストの対応関係」を明確にするのがポイント。一方向に進むだけならウォーターフォールだよ。"
          }
        },
        {
          "source": "令和3年 問39",
          "questionText": "プロトタイピングの説明として，適切なものはどれか。",
          "choices": {
            "ア": "既存のソフトウェア部品やサービスを組み合わせて開発する。",
            "イ": "前の工程が完了してから次の工程に進む。",
            "ウ": "短い期間で開発と評価のサイクルを繰り返し，徐々にシステムを完成させる。",
            "エ": "利用者の要求を明確にするために，早い段階で試作品を作成する。"
          },
          "answer": "エ",
          "shortExplanation": "プロトタイピングは「試作品（プロトタイプ）」を早い段階で作って利用者に確認してもらう方法。「思ってたのと違う！」を防げるよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "既存の部品を組み合わせる方法はコンポーネント指向開発に近い説明だよ。"},
            {"choice": "イ", "verdict": "✗", "explanation": "前の工程が終わってから次に進むのはウォーターフォールモデルの特徴だよ。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "短い期間で繰り返すのはアジャイル開発やスパイラルモデルの特徴だよ。"},
            {"choice": "エ", "verdict": "◎ 正解", "explanation": "プロトタイピング＝試作品を作って要求を明確にする方法！プロトタイプ（試作品）がキーワードだよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "プロトタイプ（prototype）＝「試作品」という意味を思い出す",
              "「試作品を作る」「早い段階で確認する」がキーワード",
              "「試作品」に関する内容の選択肢を探そう"
            ],
            "trap": "ウの「短い期間で繰り返す」はアジャイル開発に近い説明。プロトタイピングのポイントは繰り返しではなく「試作品で確認する」ことだよ。"
          }
        },
        {
          "source": "令和5年 問50",
          "questionText": "DevOpsに関する記述として，最も適切なものはどれか。",
          "choices": {
            "ア": "開発チームと運用チームが密接に連携し，自動化の仕組みなどを活用して，ソフトウェアの導入や更新を迅速に進める考え方",
            "イ": "システム開発の上流工程において，業務システム全体の機能を分析し，ハードウェア，ソフトウェアなどに機能を振り分ける手法",
            "ウ": "ソフトウェア部品を組み合わせてシステムを開発する手法",
            "エ": "利用者の要求を明確にするために，システム開発の初期段階でシステムの試作品を作成し利用者に確認する手法"
          },
          "answer": "ア",
          "shortExplanation": "DevOps＝Dev（開発）＋Ops（運用）。開発チームと運用チームが協力し、自動化を使って素早くソフトウェアを届ける考え方だよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "◎ 正解", "explanation": "DevOps＝開発（Dev）と運用（Ops）の連携＋自動化で迅速にリリース。まさにDevOpsの説明だよ！"},
            {"choice": "イ", "verdict": "✗", "explanation": "これはシステム方式設計の説明だよ。上流工程で機能を振り分ける作業のことだね。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "これはコンポーネント指向開発の説明だよ。部品の組み合わせで作る手法だね。"},
            {"choice": "エ", "verdict": "✗", "explanation": "これはプロトタイピングの説明だよ。試作品を作って確認する手法だね。"}
          ],
          "solvingStrategy": {
            "steps": [
              "DevOpsの名前を分解 → Dev（Development＝開発）＋Ops（Operations＝運用）",
              "「開発と運用の連携」「自動化」「迅速」がキーワード",
              "開発チームと運用チームの協力に触れた選択肢を見つけよう"
            ],
            "trap": "DevOpsは開発手法そのものではなく、開発と運用が連携する「考え方・文化」だよ。ツールや手法だけでなく、チームの協力体制が大事なポイントだよ。"
          }
        },
        {
          "source": "令和4年 問48",
          "questionText": "システム開発における要件定義プロセスで実施する作業として，適切なものはどれか。",
          "choices": {
            "ア": "システム化する業務の内容をモデル化して，利害関係者の間で合意する。",
            "イ": "システムの構成要素であるハードウェアとソフトウェアの機能を明確にし，その割当てを行う。",
            "ウ": "ソフトウェアの品質を確認するために，テスト計画を作成する。",
            "エ": "ソフトウェアをプログラムとして実現するための設計を行う。"
          },
          "answer": "ア",
          "shortExplanation": "要件定義では業務をモデル化して「何を作るか」を関係者で合意するよ。ハードとソフトの割り当ては設計、テストやプログラム設計はもっと後の工程だよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "◎ 正解", "explanation": "業務の内容をモデル化して関係者と合意するのが要件定義の仕事！「何が必要か」を明確にする工程だよ。"},
            {"choice": "イ", "verdict": "✗", "explanation": "ハードとソフトの機能の割当てはシステム方式設計で行うこと。要件定義の後の工程だよ。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "テスト計画はテストの準備段階で作るもの。要件定義ではまだテストのことは考えないよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "プログラムの設計はソフトウェア詳細設計の工程だよ。要件定義よりずっと後の段階だよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "要件定義は開発の最初の工程であることを思い出す",
              "要件定義＝「何を作るか」を決めて合意すること",
              "最初の段階でやるべき作業を選択肢から見つけよう"
            ],
            "trap": "設計やテストなど、後の工程で行う作業と混同しないように注意。要件定義は「何を作るか」を決める工程で、「どう作るか」はまだ決めないよ。"
          }
        }
      ],
      "cardReward": {
        "cardName": "開発フローの案内人",
        "rarity": 1,
        "summary": "システム開発は要件定義→設計→実装→テスト→運用の順で進めるよ。ウォーターフォールは順番に進む方法、プロトタイピングは試作品で確認する方法。DevOpsは開発と運用の協力が大事！",
        "exp": 100,
        "gold": 200
      }
    },
    {
      "stageId": 2,
      "title": "テスト手法",
      "subtitle": "ソフトウェアのバグを見つける方法を知ろう",
      "category": "マネジメント系",
      "subcategory": "テスト技法",
      "estimatedMinutes": 15,
      "mainQuestion": {
        "source": "令和6年 問48",
        "originalText": "ソフトウェア開発のテストにおいて，ブラックボックステストで使用するテストデータの作成方法として，適切なものはどれか。",
        "choices": {
          "ア": "プログラムの全ての条件判定で，真と偽の結果が少なくとも1回は生じるようにテストデータを作成する。",
          "イ": "プログラムの全ての分岐について，少なくとも1回は実行されるようにテストデータを作成する。",
          "ウ": "プログラムの全ての命令が少なくとも1回は実行されるようにテストデータを作成する。",
          "エ": "プログラムの入力データの範囲ごとに，範囲内のデータと境界のデータでテストデータを作成する。"
        },
        "answer": "エ",
        "wordExplanations": [
          {
            "word": "ブラックボックステスト",
            "reading": "ブラックボックステスト",
            "explanation": "プログラムの中身を見ずに、入力と出力だけで正しく動くかチェックするテスト。中が見えない黒い箱のイメージだよ。"
          },
          {
            "word": "テストデータ",
            "reading": "テストデータ",
            "explanation": "テストで使うために用意する入力値のこと。いろいろなパターンを試すためにデータを工夫して作るんだよ。"
          },
          {
            "word": "境界値",
            "reading": "きょうかいち",
            "explanation": "条件の境目にある値のこと。例えば「18歳以上」なら17と18が境界値。バグが見つかりやすいポイントだよ。"
          }
        ],
        "questionExplained": "この問題は「ブラックボックステストではどうやってテストデータを作る？」を聞いているよ。\n\nブラックボックステストはプログラムの中身を見ないで、外から見える入力と出力の関係だけでテストするんだ。だから、入力データの範囲や境界値に注目してテストデータを作るんだよ。",
        "choiceAnalysis": [
          {
            "choice": "ア",
            "verdict": "✗",
            "explanation": "「条件判定の真と偽」はプログラムの内部構造を見る必要があるよ。これはホワイトボックステストの手法（条件網羅）だね。"
          },
          {
            "choice": "イ",
            "verdict": "✗",
            "explanation": "「全ての分岐を実行」もプログラムの中を見る必要があるよ。これもホワイトボックステストの手法（分岐網羅）だね。"
          },
          {
            "choice": "ウ",
            "verdict": "✗",
            "explanation": "「全ての命令を実行」もプログラムの中身を見る手法だよ。ホワイトボックステスト（命令網羅）の考え方だね。"
          },
          {
            "choice": "エ",
            "verdict": "◎ 正解",
            "explanation": "入力データの範囲と境界に注目するのがブラックボックステスト！プログラムの中身は見ずに、入出力だけでテストするよ。"
          }
        ],
        "solvingStrategy": {
          "steps": [
            "「ブラックボックス」＝中が見えない黒い箱 → プログラムの中身は見ない",
            "中身を見ない＝入力と出力だけに注目する",
            "「入力データの範囲」「境界値」に注目した選択肢を探そう"
          ],
          "trap": "ア〜ウはすべて「プログラムの中を見る」ホワイトボックステストの手法だよ。ブラックボックスとホワイトボックスを混同しないようにしよう。"
        }
      },
      "relatedKnowledge": {
        "title": "テストの種類と手法を覚えよう",
        "content": [
          {
            "term": "単体テスト",
            "description": "プログラムを1つの部品（モジュール）ごとに個別にテストすること。パズルの1ピースが正しい形かを確認するイメージだよ。"
          },
          {
            "term": "結合テスト",
            "description": "複数の部品（モジュール）をつなげて、正しく連携するかをテストすること。パズルのピースがちゃんとはまるかを確認するイメージだよ。"
          },
          {
            "term": "システムテスト",
            "description": "システム全体を動かして、要件通りに動くかをテストすること。完成したパズル全体が正しいかを確認するイメージだよ。"
          },
          {
            "term": "受入れテスト",
            "description": "最終的にお客さん（利用者）が「これでOK！」と確認するテスト。注文した料理が自分の注文通りかを確認するのと同じだよ。"
          },
          {
            "term": "ブラックボックステスト",
            "description": "プログラムの中身を見ずに、入力と出力だけでテストする方法。「同値分割」や「境界値分析」という手法があるよ。"
          },
          {
            "term": "ホワイトボックステスト",
            "description": "プログラムの中身（コード）を見て、すべての処理が正しく動くかをテストする方法。命令網羅や分岐網羅という手法があるよ。"
          }
        ]
      },
      "practiceQuestions": [
        {
          "source": "令和5年 問47",
          "questionText": "ソフトウェアのテストの種類のうち，ソフトウェア保守のために行った変更によって，影響を受けないはずの箇所に影響を及ぼしていないかどうかを確認する目的で行うものはどれか。",
          "choices": {
            "ア": "結合テスト",
            "イ": "システムテスト",
            "ウ": "単体テスト",
            "エ": "リグレッションテスト"
          },
          "answer": "エ",
          "shortExplanation": "リグレッション（回帰）テストは「修正したら他の場所が壊れてないか」を確認するテスト。ソフトの修正後に、影響がないはずの部分を再テストするよ。",
          "questionExplained": "この問題は「プログラムを直した後に、他の部分に悪影響が出ていないかを確認するテストは何？」を聞いているよ。\n\nプログラムを1か所直すと、思わぬ場所に影響が出ることがあるんだ。それを確認するのがリグレッション（回帰）テストだよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "結合テストは複数のモジュールをつなげて動作確認するテスト。修正後の影響確認とは目的が違うよ。"},
            {"choice": "イ", "verdict": "✗", "explanation": "システムテストはシステム全体が要件通りか確認するテスト。修正後の影響確認とは目的が違うよ。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "単体テストは1つのモジュールだけをテストすること。他の場所への影響確認ではないよ。"},
            {"choice": "エ", "verdict": "◎ 正解", "explanation": "リグレッション（回帰）テスト＝修正が他に悪影響を与えていないか確認するテスト！「影響を受けないはずの箇所」がキーワードだよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "「変更によって影響を受けないはずの箇所」がキーワード",
              "リグレッション（回帰）＝「元に戻る」→ 修正で他が壊れていないかチェック",
              "修正後に影響を確認するテストの名前を思い出そう"
            ],
            "trap": "結合テストやシステムテストも大切だけど、「修正による予期しない影響を確認する」のはリグレッションテストの役割だよ。目的の違いに注目しよう。"
          }
        },
        {
          "source": "令和3年 問45",
          "questionText": "ホワイトボックステストのテストケース作成に関する記述として，適切なものはどれか。",
          "choices": {
            "ア": "プログラムの外部仕様に基づいて，テストケースを作成する。",
            "イ": "プログラムの全ての分岐を少なくとも1回は実行するように，テストケースを作成する。",
            "ウ": "プログラムの入力と出力に着目して，テストケースを作成する。",
            "エ": "プログラムへの入力データの境界値に着目して，テストケースを作成する。"
          },
          "answer": "イ",
          "shortExplanation": "ホワイトボックステストはプログラムの中身を見てテストする方法。全ての分岐を実行するようにテストケースを作るのがホワイトボックステストの考え方だよ。",
          "questionExplained": "この問題は「ホワイトボックステストのテストケースはどう作る？」を聞いているよ。\n\nホワイトボックス（白い箱）＝中身が見える。プログラムのコードを見て、全ての処理経路や分岐を通るようにテストを作るんだ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "外部仕様に基づくのはブラックボックステストの考え方だよ。中身は見ないで外から確認するやり方だね。"},
            {"choice": "イ", "verdict": "◎ 正解", "explanation": "プログラムの分岐を確認するのがホワイトボックステスト！全ての分岐を通るようにテストするよ。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "入力と出力に着目するのはブラックボックステストの考え方。中身を見ないテスト方法だよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "境界値に着目するのはブラックボックステストの「境界値分析」という手法だよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "ホワイトボックス＝中が見える白い箱 → プログラムの中身を見る",
              "中身を見る＝分岐や命令など処理経路に注目する",
              "プログラムの内部構造に着目した選択肢を探そう"
            ],
            "trap": "ア・ウ・エはすべてブラックボックステストの手法だよ。「外部仕様」「入出力」「境界値」はブラックボックス、「分岐」「命令」はホワイトボックスのキーワードだよ。"
          }
        },
        {
          "source": "令和7年 問45",
          "questionText": "ソフトウェア開発において，上流工程から順に，システム要件定義，ソフトウェア要件定義，ソフトウェア方式設計，ソフトウェア詳細設計の順に実施する。各工程とテストの対応として，適切なものはどれか。",
          "choices": {
            "ア": "システム要件定義 — システムテスト",
            "イ": "ソフトウェア要件定義 — 単体テスト",
            "ウ": "ソフトウェア方式設計 — システムテスト",
            "エ": "ソフトウェア詳細設計 — 結合テスト"
          },
          "answer": "ア",
          "shortExplanation": "V字モデルではシステム要件定義はシステムテストに対応するよ。ソフトウェア要件定義は結合テスト、ソフトウェア詳細設計は単体テストに対応するんだ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "◎ 正解", "explanation": "システム要件定義で決めたことを確認するのがシステムテスト。V字モデルの対応関係がピッタリだよ！"},
            {"choice": "イ", "verdict": "✗", "explanation": "ソフトウェア要件定義に対応するのは結合テストだよ。単体テストはソフトウェア詳細設計に対応するんだ。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "ソフトウェア方式設計に対応するのは結合テスト。システムテストはシステム要件定義に対応するよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "ソフトウェア詳細設計に対応するのは単体テスト。結合テストはソフトウェア方式設計に対応するよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "V字モデルの対応関係を思い出す",
              "上流の工程ほど大きなテストに対応する（システム要件定義→システムテスト）",
              "それぞれの工程とテストの組み合わせが正しい選択肢を探そう"
            ],
            "trap": "対応関係がごちゃごちゃになりやすいよ。上流→大きなテスト、下流→小さなテストと覚えると整理しやすいよ。"
          }
        },
        {
          "source": "令和4年 問41",
          "questionText": "ソフトウェアの受入れテストに関する説明として，適切なものはどれか。",
          "choices": {
            "ア": "開発者が行うテストであり，プログラム間のインタフェースが正しいかを確認するテスト",
            "イ": "開発者が行うテストであり，プログラムのソースコードに基づいて実施するテスト",
            "ウ": "発注者が行うテストであり，ソフトウェアが発注者の要求を満たしているかを確認するテスト",
            "エ": "発注者が行うテストであり，プログラムが設計書どおりに動作するかを確認するテスト"
          },
          "answer": "ウ",
          "shortExplanation": "受入れテストは発注者（お客さん）が「注文通りに作ってくれたかな？」を確認するテスト。自分の要求を満たしているかをチェックするよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "プログラム間のインタフェース確認は結合テスト。しかも「開発者が行う」から受入れテストとは違うよ。"},
            {"choice": "イ", "verdict": "✗", "explanation": "ソースコードに基づくテストはホワイトボックステスト。開発者が行うもので、受入れテストとは違うよ。"},
            {"choice": "ウ", "verdict": "◎ 正解", "explanation": "受入れテスト＝発注者が要求通りかを確認するテスト！「注文した料理が合っているか確認する」のと同じだよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "設計書通りかの確認はシステムテストの考え方。受入れテストは「発注者の要求を満たすか」がポイントだよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "「受入れ」＝お客さん（発注者）が「受け入れる」かどうかを確認すること",
              "誰が行うか（発注者）と何を確認するか（要求を満たすか）の2点に注目",
              "「発注者」が「要求を満たすかを確認する」という選択肢を見つけよう"
            ],
            "trap": "エも「発注者が行う」とあるけど、「設計書どおりに動作するか」は開発者側の確認事項。受入れテストは「要求を満たしているか」がチェックポイントだよ。"
          }
        },
        {
          "source": "令和6年 問40",
          "questionText": "テストで使用するテストデータの作成に対する考え方のうち，ブラックボックステストの考え方に基づいているものはどれか。",
          "choices": {
            "ア": "条件分岐のすべての経路を少なくとも1回通るデータを用意する。",
            "イ": "すべての命令を少なくとも1回実行するデータを用意する。",
            "ウ": "入力条件の境界値付近のデータを用意する。",
            "エ": "複数の条件が組み合わされたすべてのパターンを網羅するデータを用意する。"
          },
          "answer": "ウ",
          "shortExplanation": "ブラックボックステストは中身を見ないテスト。「入力の境界値に注目する」のがブラックボックステストの代表的な手法（境界値分析）だよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "条件分岐の経路はプログラムの中を見る必要があるよ。ホワイトボックステストの分岐網羅だね。"},
            {"choice": "イ", "verdict": "✗", "explanation": "すべての命令を実行するのもプログラムの中身を見る手法。ホワイトボックステストの命令網羅だね。"},
            {"choice": "ウ", "verdict": "◎ 正解", "explanation": "入力条件の境界値に注目するのがブラックボックステスト！中身を見ないで入力の範囲と境界で確認するよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "条件の組み合わせパターンを網羅するのもプログラムの中身を見る手法。ホワイトボックステストの考え方だよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "ブラックボックス＝中が見えない → プログラムの中身は使わない",
              "「入力」や「出力」に関するキーワードを探す",
              "プログラムの外側（入力データ）に着目している選択肢を見つけよう"
            ],
            "trap": "「条件分岐」「命令」「経路」はすべてプログラムの中身に関するキーワード。これらはホワイトボックステストだよ。ブラックボックスは「入力と出力」がキーワードだよ。"
          }
        }
      ],
      "cardReward": {
        "cardName": "テストの達人",
        "rarity": 1,
        "summary": "テストには単体→結合→システム→受入れの流れがあるよ。ブラックボックステストは中身を見ずに入出力で確認、ホワイトボックステストは中身を見てチェック。リグレッションテストは修正後の影響確認！",
        "exp": 100,
        "gold": 200
      }
    },
    {
      "stageId": 3,
      "title": "アジャイル開発",
      "subtitle": "素早く・柔軟にソフトウェアを作る方法",
      "category": "マネジメント系",
      "subcategory": "開発プロセス・手法",
      "estimatedMinutes": 15,
      "mainQuestion": {
        "source": "令和6年 問42",
        "originalText": "アジャイル開発の特徴として，最も適切なものはどれか。",
        "choices": {
          "ア": "大規模なプロジェクトを計画的に進めるのに適しており，工程ごとに成果物をレビューして次の工程に進む。",
          "イ": "各工程の終了時に成果物を作成し，前の工程に手戻りしないようにする。",
          "ウ": "短い期間の開発を繰り返して，少しずつ機能を追加しながらソフトウェアを完成させていく。",
          "エ": "利用者にとって必要な機能の優先順位は最初に確定させ，後から変更することはしない。"
        },
        "answer": "ウ",
        "wordExplanations": [
          {
            "word": "アジャイル",
            "reading": "アジャイル",
            "explanation": "「素早い」「機敏な」という意味の英語。短い期間で開発を繰り返し、変化に柔軟に対応する開発手法のことだよ。"
          },
          {
            "word": "イテレーション",
            "reading": "イテレーション",
            "explanation": "アジャイル開発で繰り返す短い開発サイクルのこと。1〜4週間くらいの短い期間で計画→開発→テストを行うよ。"
          },
          {
            "word": "スプリント",
            "reading": "スプリント",
            "explanation": "スクラムというアジャイル手法で使われる開発の単位。1〜4週間の固定期間で動くソフトウェアを作るんだよ。"
          }
        ],
        "questionExplained": "この問題は「アジャイル開発ってどんな特徴がある開発方法？」を聞いているよ。\n\nアジャイル開発は「素早く・柔軟に」がモットー。短い期間で少しずつ機能を追加していくから、お客さんの要望の変化にも対応しやすいんだ。",
        "choiceAnalysis": [
          {
            "choice": "ア",
            "verdict": "✗",
            "explanation": "「大規模」「計画的」「工程ごとに成果物をレビュー」はウォーターフォールモデルの特徴だよ。アジャイルは小さく素早くがモットーだよ。"
          },
          {
            "choice": "イ",
            "verdict": "✗",
            "explanation": "「前の工程に戻らない」のもウォーターフォールモデルの考え方。アジャイルは柔軟に変化に対応するのが特徴だよ。"
          },
          {
            "choice": "ウ",
            "verdict": "◎ 正解",
            "explanation": "短い期間の繰り返し＋少しずつ機能追加がアジャイル開発の特徴！変化に柔軟に対応できるんだ。"
          },
          {
            "choice": "エ",
            "verdict": "✗",
            "explanation": "アジャイルは「変化を歓迎する」のが特徴。優先順位を最初に固定するのはアジャイルの考え方とは正反対だよ。"
          }
        ],
        "solvingStrategy": {
          "steps": [
            "アジャイル（agile）＝「素早い」「機敏な」という意味",
            "「短い期間」「繰り返し」「変化に対応」がキーワード",
            "素早く柔軟な開発手法の説明を選択肢から探そう"
          ],
          "trap": "ウォーターフォールモデルの特徴とアジャイルの特徴を混同しないように注意。「計画的に順番に進む」のがウォーターフォール、「短い期間で繰り返す」のがアジャイルだよ。"
        }
      },
      "relatedKnowledge": {
        "title": "アジャイル開発の用語を覚えよう",
        "content": [
          {
            "term": "アジャイル開発",
            "description": "短い開発サイクルを繰り返して、少しずつソフトウェアを完成させる開発手法。変化するお客さんの要望に柔軟に対応できるのが強みだよ。"
          },
          {
            "term": "スクラム",
            "description": "アジャイル開発の代表的な手法の一つ。チーム全員が協力して、短い期間（スプリント）で動くソフトウェアを作り続けるフレームワークだよ。"
          },
          {
            "term": "プロダクトバックログ",
            "description": "開発するべき機能や改善点を優先順位をつけて並べたリストのこと。「やることリスト」のようなもので、上から順番に開発していくよ。"
          },
          {
            "term": "スプリント",
            "description": "スクラムで使われる開発の単位期間（1〜4週間）。この期間内に計画→開発→テスト→振り返りを行って、動くソフトウェアを作るよ。"
          },
          {
            "term": "XP（エクストリームプログラミング）",
            "description": "アジャイル開発の手法の一つ。ペアプログラミング（2人で1台のPCを使ってプログラミング）やテスト駆動開発などの実践的な技法を使うよ。"
          },
          {
            "term": "カンバン",
            "description": "作業の状況を「未着手」「作業中」「完了」などのカードで可視化する手法。ホワイトボードに付箋を貼って進み具合を見える化するイメージだよ。"
          }
        ]
      },
      "practiceQuestions": [
        {
          "source": "令和5年 問40",
          "questionText": "アジャイル開発の方法論であるスクラムに関する記述として，最も適切なものはどれか。",
          "choices": {
            "ア": "スクラムチームの中心はスクラムマスタであり，スクラムマスタがプロダクトの方針や機能についての最終決定権をもつ。",
            "イ": "スプリントの期間は固定であり，途中で期間を延長することは認められていない。",
            "ウ": "スプリントプランニングでは，前回のスプリントの結果を検査し，今後の改善策を話し合う。",
            "エ": "プロダクトバックログの項目の優先順位は，全てのスプリントが終了してから見直しを行う。"
          },
          "answer": "イ",
          "shortExplanation": "スクラムのスプリントは1〜4週間の固定期間。途中で延長はしないのがルールだよ。決めた期間内でできることをやりきるんだ。",
          "questionExplained": "この問題は「スクラムのルールで正しいものはどれ？」を聞いているよ。\n\nスクラムにはいくつかの大切なルールがあるんだ。その中でも「スプリントの期間は固定」というのは基本中の基本。途中で「もうちょっと時間をちょうだい」とは言えないんだよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "プロダクトの方針や機能の最終決定権を持つのはプロダクトオーナーだよ。スクラムマスタはチームがスクラムをうまく進められるように支援する役割だよ。"},
            {"choice": "イ", "verdict": "◎ 正解", "explanation": "スプリントの期間は固定！延長はしないのがスクラムの基本ルール。決めた期間でできる範囲を作るんだよ。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "前回の結果を検査して改善策を話し合うのは「スプリントレトロスペクティブ（振り返り）」だよ。スプリントプランニングは「次に何をやるか」を計画する会議だよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "プロダクトバックログの優先順位は随時見直しOK。全部終わってからではなく、状況に合わせて柔軟に変えていくんだよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "スクラムの基本用語を確認：スプリント、スクラムマスタ、プロダクトオーナー",
              "それぞれの役割とルールが正しいかを各選択肢で確認する",
              "スクラムの基本ルールに合った選択肢を選ぼう"
            ],
            "trap": "スクラムマスタとプロダクトオーナーの役割を間違えやすいよ。スクラムマスタ＝チームの支援役、プロダクトオーナー＝プロダクトの責任者と覚えよう。"
          }
        },
        {
          "source": "令和4年 問39",
          "questionText": "XP（エクストリームプログラミング）のプラクティス（実践）の一つであるペアプログラミングの説明はどれか。",
          "choices": {
            "ア": "2人のプログラマが，それぞれ別のプログラムを同時に開発する。",
            "イ": "2人のプログラマが，同じコンピュータを使って，一緒にプログラミングする。",
            "ウ": "テストケースを作成してからプログラムのコーディングを行う。",
            "エ": "プログラムの機能を変更せずに，内部構造を改善する。"
          },
          "answer": "イ",
          "shortExplanation": "ペアプログラミングは2人で1台のPCを使って一緒にプログラミングする方法。1人が書いて、もう1人がチェックしながら進めるんだよ。",
          "questionExplained": "この問題は「ペアプログラミングってどんなやり方？」を聞いているよ。\n\nペア（pair）＝2人組という意味。2人で1台のコンピュータに向かって一緒にプログラミングするんだ。1人がコードを書く「ドライバー」、もう1人がチェックする「ナビゲーター」の役割を交代しながら進めるよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "別々にプログラムを作るのはペアプログラミングではないよ。「一緒に」やるのがポイントだよ。"},
            {"choice": "イ", "verdict": "◎ 正解", "explanation": "2人で同じPCを使って一緒にプログラミング！これがペアプログラミング。ミスが減って品質が上がるんだよ。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "テストケースを先に作るのは「テスト駆動開発（TDD）」だよ。XPのプラクティスの一つだけど、ペアプログラミングとは違うよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "機能を変えずに内部構造を改善するのは「リファクタリング」だよ。これもXPのプラクティスだけど、ペアプログラミングとは違うよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "「ペア」＝「2人組」という意味を思い出す",
              "2人で一緒に同じ作業をするのがポイント",
              "「2人で同じPCを使う」という内容の選択肢を見つけよう"
            ],
            "trap": "ウの「テスト駆動開発」やエの「リファクタリング」もXPのプラクティスだよ。問われているのは「ペアプログラミング」だから、名前の意味（ペア＝2人組）に注目しよう。"
          }
        },
        {
          "source": "令和7年 問40",
          "questionText": "アジャイル開発のプロダクトバックログの説明として，最も適切なものはどれか。",
          "choices": {
            "ア": "開発したプロダクトの不具合の修正履歴を記録したリスト",
            "イ": "開発チームのメンバごとの作業実績を記録したリスト",
            "ウ": "プロダクトに必要な機能などの要求を優先順位付けして並べたリスト",
            "エ": "プロダクトのソースコードの変更履歴を記録したリスト"
          },
          "answer": "ウ",
          "shortExplanation": "プロダクトバックログは「やることリスト」。プロダクトに必要な機能や改善を優先順位をつけて並べたもの。上から順に開発していくよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "不具合の修正履歴はバグトラッキングツールで管理するもの。プロダクトバックログとは違うよ。"},
            {"choice": "イ", "verdict": "✗", "explanation": "メンバの作業実績は進捗管理の話。プロダクトバックログは「何を作るか」のリストだよ。"},
            {"choice": "ウ", "verdict": "◎ 正解", "explanation": "プロダクトバックログ＝機能や要求を優先順位付けしたリスト！「やることリスト」のイメージだよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "ソースコードの変更履歴はバージョン管理システムで管理するもの。プロダクトバックログとは別物だよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "「バックログ」＝「やるべきことの一覧」という意味を覚えよう",
              "プロダクトバックログ＝プロダクトに必要なことの優先順位リスト",
              "「優先順位付け」「要求のリスト」というキーワードに注目しよう"
            ],
            "trap": "「ログ」とつくので記録や履歴と間違えやすいけど、バックログは「これからやること」のリストだよ。過去の記録ではないことに注意しよう。"
          }
        },
        {
          "source": "令和3年 問44",
          "questionText": "アジャイル開発の方法論であるスクラムにおいて，短い間隔で繰り返される開発期間を何と呼ぶか。",
          "choices": {
            "ア": "スクラムマスタ",
            "イ": "スプリント",
            "ウ": "プロダクトオーナー",
            "エ": "プロダクトバックログ"
          },
          "answer": "イ",
          "shortExplanation": "スプリントは短い開発期間（1〜4週間）のこと。スクラムではこのスプリントを繰り返して、少しずつソフトウェアを完成させていくよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "スクラムマスタはチームがスクラムをうまく進められるように支援する「人の役割」だよ。開発期間のことではないよ。"},
            {"choice": "イ", "verdict": "◎ 正解", "explanation": "スプリント＝短い開発期間！スプリントは「短距離走」という意味で、短い期間で全力で開発するイメージだよ。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "プロダクトオーナーはプロダクトの方針を決める「人の役割」だよ。開発期間のことではないよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "プロダクトバックログは「やることリスト」。開発期間ではなく、開発すべき機能のリストだよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "スクラムの用語を整理しよう：役割名か、期間の名前か、リストの名前か",
              "「短い間隔で繰り返される開発期間」＝時間に関する用語を探す",
              "期間を表す用語を選択肢から見つけよう"
            ],
            "trap": "スクラムマスタやプロダクトオーナーは「人の役割」、プロダクトバックログは「リスト」、スプリントは「期間」。種類を間違えないようにしよう。"
          }
        },
        {
          "source": "令和5年 問44",
          "questionText": "作業の進捗状況を「未着手」，「着手」，「完了」のように可視化することで管理する手法はどれか。",
          "choices": {
            "ア": "カンバン",
            "イ": "スクラム",
            "ウ": "テスト駆動開発",
            "エ": "ペアプログラミング"
          },
          "answer": "ア",
          "shortExplanation": "カンバンは作業をカードにして「未着手」「作業中」「完了」の列に分けて貼ることで、進み具合を見える化する手法だよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "◎ 正解", "explanation": "カンバン＝作業を可視化する手法！ホワイトボードに付箋を貼って「見える化」するイメージだよ。"},
            {"choice": "イ", "verdict": "✗", "explanation": "スクラムはアジャイル開発のフレームワーク全体のこと。可視化だけの手法ではないよ。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "テスト駆動開発はテストを先に書いてからコードを書く手法。進捗の可視化とは違うよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "ペアプログラミングは2人で一緒にプログラミングする手法。進捗の可視化とは違うよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "「可視化」＝目に見える形にすること、がポイント",
              "カンバンの「看板」は日本語で「目に見える表示」の意味",
              "「見える化」「可視化」に関する手法を選択肢から選ぼう"
            ],
            "trap": "スクラムもアジャイルの手法だけど、スクラムはフレームワーク全体のこと。「可視化で管理する」という特定の手法はカンバンだよ。"
          }
        }
      ],
      "cardReward": {
        "cardName": "アジャイルの伝道師",
        "rarity": 1,
        "summary": "アジャイル開発は短い期間で繰り返して少しずつ完成させる方法。スクラムではスプリントという固定期間で開発し、プロダクトバックログで優先順位を管理するよ。カンバンで進捗を見える化しよう！",
        "exp": 100,
        "gold": 200
      }
    },
    {
      "stageId": 4,
      "title": "プロジェクトマネジメント",
      "subtitle": "プロジェクトを成功に導く管理の基本",
      "category": "マネジメント系",
      "subcategory": "PM基礎",
      "estimatedMinutes": 15,
      "mainQuestion": {
        "source": "令和6年 問36",
        "originalText": "プロジェクトマネジメントにおいてWBSを作成する目的として，最も適切なものはどれか。",
        "choices": {
          "ア": "作業を細分化して，プロジェクトで実施すべき作業を洗い出す。",
          "イ": "プロジェクトで必要な費用を，過去の類似プロジェクトを基にして算出する。",
          "ウ": "プロジェクトの成果物を利害関係者に引き渡す段取りを決める。",
          "エ": "プロジェクトメンバのスキルを高めるための教育計画を作成する。"
        },
        "answer": "ア",
        "wordExplanations": [
          {
            "word": "WBS",
            "reading": "ダブリュービーエス",
            "explanation": "Work Breakdown Structure（作業分解構成図）の略。プロジェクトの作業を細かく分けて整理する図のこと。「やることリスト」を階層的に作るイメージだよ。"
          },
          {
            "word": "プロジェクトマネジメント",
            "reading": "プロジェクトマネジメント",
            "explanation": "プロジェクトを成功させるために、計画を立てて進み具合を管理すること。「文化祭の準備を計画的に進める」のと似ているよ。"
          },
          {
            "word": "スコープ",
            "reading": "スコープ",
            "explanation": "プロジェクトで「やること」と「やらないこと」の範囲のこと。最初にスコープを決めておかないと、やることがどんどん増えてしまうよ。"
          }
        ],
        "questionExplained": "この問題は「WBSは何のために作るの？」を聞いているよ。\n\nWBS（Work Breakdown Structure）は「作業を分解する構造図」という意味。プロジェクトの大きな作業を小さく分解していって、何をやるべきかを全て洗い出すために作るんだ。",
        "choiceAnalysis": [
          {
            "choice": "ア",
            "verdict": "◎ 正解",
            "explanation": "WBS＝作業を細分化して洗い出すためのもの！大きな作業を小さく分けて「やること」を全部見つけ出すんだ。"
          },
          {
            "choice": "イ",
            "verdict": "✗",
            "explanation": "過去のプロジェクトを基にした費用の算出は「類推見積もり」の話。WBSの目的とは違うよ。"
          },
          {
            "choice": "ウ",
            "verdict": "✗",
            "explanation": "成果物の引き渡しの段取りはプロジェクトの終結フェーズの話。WBSの目的とは違うよ。"
          },
          {
            "choice": "エ",
            "verdict": "✗",
            "explanation": "教育計画は人的資源管理の話。WBSは作業の洗い出しが目的で、教育計画とは関係ないよ。"
          }
        ],
        "solvingStrategy": {
          "steps": [
            "WBSの名前を分解 → Work（作業）Breakdown（分解）Structure（構造図）",
            "「作業を分解する」がWBSの目的だと名前からわかる",
            "「作業を細分化」「洗い出し」に関する選択肢を見つけよう"
          ],
          "trap": "WBSは費用の見積もりやスケジュール管理にも使われるけど、WBSの本来の目的は「作業の洗い出し」だよ。他の用途と混同しないようにしよう。"
        }
      },
      "relatedKnowledge": {
        "title": "プロジェクトマネジメントの基本用語",
        "content": [
          {
            "term": "プロジェクト",
            "description": "ある目標を達成するために、期限を決めて行う一時的な活動のこと。文化祭の準備や修学旅行の計画のように、ゴールと期限があるのが特徴だよ。"
          },
          {
            "term": "PMBOK（ピンボック）",
            "description": "プロジェクトマネジメントの知識をまとめた世界的なガイドブック。「プロジェクトを成功させるためのコツ集」のようなものだよ。"
          },
          {
            "term": "ステークホルダ",
            "description": "プロジェクトに関わる全ての人のこと。お客さん、開発メンバ、上司など、プロジェクトの影響を受ける人や影響を与える人の全員がステークホルダだよ。"
          },
          {
            "term": "プロジェクト憲章",
            "description": "プロジェクトの目的やゴール、責任者などを書いた公式文書。「このプロジェクトをやっていいですよ」という許可証のようなものだよ。"
          },
          {
            "term": "WBS",
            "description": "Work Breakdown Structureの略で、作業を細かく分解した図。ツリー（木）のような形で、大きな作業を小さな作業に分けていくんだよ。"
          },
          {
            "term": "スコープ",
            "description": "プロジェクトで「やること」の範囲。スコープをはっきり決めておかないと、あれもこれもと作業が増えて大変なことになるよ。これを「スコープクリープ」と言うんだ。"
          }
        ]
      },
      "practiceQuestions": [
        {
          "source": "令和5年 問36",
          "questionText": "プロジェクトマネジメントにおいて，プロジェクトの開始を正式に認可する文書はどれか。",
          "choices": {
            "ア": "プロジェクト憲章",
            "イ": "プロジェクトスコープ記述書",
            "ウ": "プロジェクト報告書",
            "エ": "WBS"
          },
          "answer": "ア",
          "shortExplanation": "プロジェクト憲章は「このプロジェクトを始めてOK！」という正式な許可証。プロジェクトの目的や責任者が書かれているよ。",
          "questionExplained": "この問題は「プロジェクトを正式にスタートさせる文書は何？」を聞いているよ。\n\nプロジェクトを始めるには「この活動を正式にやっていいですよ」という許可が必要なんだ。その許可証がプロジェクト憲章だよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "◎ 正解", "explanation": "プロジェクト憲章＝プロジェクトの開始を正式に認可する文書！目的、責任者、予算などが書かれるよ。"},
            {"choice": "イ", "verdict": "✗", "explanation": "プロジェクトスコープ記述書はプロジェクトの範囲（やること）を詳しく書いた文書。開始の認可文書ではないよ。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "プロジェクト報告書は進捗や結果を報告するための文書。プロジェクトの途中や終了時に作るものだよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "WBSは作業を細分化した図。プロジェクトの開始を認可するものではないよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "「正式に認可する」＝「始めてOK！と許可する」がキーワード",
              "「憲章」は重要な約束事や基本方針を定めた文書のこと",
              "プロジェクトの開始を許可する公式文書を選択肢から探そう"
            ],
            "trap": "WBSもプロジェクトの初期に作るけど、WBSは「作業の洗い出し」のためのもので、開始を認可する文書ではないよ。"
          }
        },
        {
          "source": "令和3年 問36",
          "questionText": "プロジェクトのステークホルダの説明として，最も適切なものはどれか。",
          "choices": {
            "ア": "プロジェクトに参加するために特別な技術を持った専門家",
            "イ": "プロジェクトに直接的又は間接的に影響を与えたり，影響を受けたりする人や組織",
            "ウ": "プロジェクトの遂行について全責任を持つ管理者",
            "エ": "プロジェクトの目標達成のために資金を提供する出資者"
          },
          "answer": "イ",
          "shortExplanation": "ステークホルダは「利害関係者」のこと。プロジェクトに関わる全ての人（お客さん、メンバ、上司など）を指すよ。特定の人だけではないんだ。",
          "questionExplained": "この問題は「ステークホルダって誰のこと？」を聞いているよ。\n\nステークホルダ（stakeholder）は「利害関係者」と訳されるよ。プロジェクトに影響を与える人も、影響を受ける人も、全員がステークホルダなんだ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "専門家もステークホルダの一部だけど、専門家だけを指すわけではないよ。範囲が狭すぎるね。"},
            {"choice": "イ", "verdict": "◎ 正解", "explanation": "ステークホルダ＝プロジェクトに影響を与える・受ける全ての人や組織！範囲が広いのがポイントだよ。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "全責任を持つ管理者はプロジェクトマネージャのこと。ステークホルダはもっと広い意味だよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "出資者（スポンサー）もステークホルダの一部だけど、出資者だけを指すわけではないよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "ステークホルダ＝「利害関係者」全員のことを思い出す",
              "特定の1人ではなく「影響を与える・受ける全ての人」が含まれる",
              "一番範囲が広い説明の選択肢を探そう"
            ],
            "trap": "ア・ウ・エはどれもステークホルダの一部だけど、ステークホルダ全体の説明としては狭すぎるよ。「全ての関係者」を含む広い説明を選ぼう。"
          }
        },
        {
          "source": "令和7年 問36",
          "questionText": "あるプロジェクトでは四つの作業A〜Dを行う。各作業の所要日数と先行作業が表のとおりであるとき，プロジェクト全体の所要日数は何日か。作業A：3日（先行作業なし），作業B：5日（先行作業A），作業C：4日（先行作業A），作業D：2日（先行作業B，C）",
          "choices": {
            "ア": "8",
            "イ": "10",
            "ウ": "12",
            "エ": "14"
          },
          "answer": "イ",
          "shortExplanation": "クリティカルパスを求めよう。A→B→D＝3+5+2＝10日、A→C→D＝3+4+2＝9日。一番長い経路が10日だからプロジェクト全体は10日だよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "8日はA→B（3+5）だけの計算。作業Dも必要だから足りないよ。"},
            {"choice": "イ", "verdict": "◎ 正解", "explanation": "A→B→D＝3+5+2＝10日がクリティカルパス（一番長い経路）だよ！"},
            {"choice": "ウ", "verdict": "✗", "explanation": "12日は全部の作業を足した日数ではないよ。並行して進められる作業があるんだ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "14日は全部の作業を足した数（3+5+4+2）。並行作業を考えていない計算だよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "先行作業の関係から、作業の流れ（経路）を書き出す",
              "全ての経路の所要日数を計算する",
              "一番長い経路（クリティカルパス）がプロジェクト全体の日数になるよ"
            ],
            "trap": "全ての作業の日数を単純に合計すると14日になるけど、BとCはAの後に並行して進められるから、一番長い経路だけを見ればOKだよ。"
          }
        },
        {
          "source": "令和4年 問36",
          "questionText": "プロジェクトマネジメントにおいて，スコープを定義する目的として，最も適切なものはどれか。",
          "choices": {
            "ア": "プロジェクトチームのメンバに必要なスキルを明確にする。",
            "イ": "プロジェクトで行う作業と成果物の範囲を明確にする。",
            "ウ": "プロジェクトに必要な予算を確定する。",
            "エ": "プロジェクトの完了時期を確定する。"
          },
          "answer": "イ",
          "shortExplanation": "スコープは「やることの範囲」。プロジェクトで何をやって何をやらないかを明確にすることで、作業が無限に増えるのを防ぐよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "メンバのスキルを明確にするのは人的資源管理の話。スコープ定義の目的ではないよ。"},
            {"choice": "イ", "verdict": "◎ 正解", "explanation": "スコープ＝作業と成果物の「範囲」を明確にすること！「やること」と「やらないこと」を決めるんだ。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "予算の確定はコスト管理の話。スコープは範囲のことで、お金の話ではないよ。"},
            {"choice": "エ", "verdict": "✗", "explanation": "完了時期の確定はスケジュール管理の話。スコープは範囲のことで、期限の話ではないよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "スコープ（scope）＝「範囲」という意味の英語",
              "プロジェクトのスコープ＝「やることの範囲」を決めること",
              "「範囲を明確にする」という内容の選択肢を探そう"
            ],
            "trap": "予算や期限もプロジェクト管理で重要だけど、スコープは「範囲」のこと。予算はコスト、期限はスケジュール、範囲はスコープと区別しよう。"
          }
        },
        {
          "source": "令和3年 問40",
          "questionText": "プロジェクトマネジメントのプロセスのうち，リスクへの対応計画を立てるプロセスで実施するものはどれか。",
          "choices": {
            "ア": "過去のプロジェクトの事例を参考にしてリスクを洗い出し，リスクの一覧を作成する。",
            "イ": "残存リスクの状況を監視し，新たなリスクの兆候を把握する。",
            "ウ": "洗い出されたリスクの発生確率と影響度を査定する。",
            "エ": "特定されたリスクに対して，リスクを軽減するための対策を決める。"
          },
          "answer": "エ",
          "shortExplanation": "リスクへの対応計画では「見つけたリスクに対してどう対策するか」を決めるよ。リスクの洗い出しや分析とは別のプロセスだよ。",
          "choiceAnalysis": [
            {"choice": "ア", "verdict": "✗", "explanation": "リスクの洗い出しは「リスク特定」のプロセス。対応計画を立てる前の段階だよ。"},
            {"choice": "イ", "verdict": "✗", "explanation": "リスクの監視は「リスクコントロール」のプロセス。対応計画を実行した後に行うことだよ。"},
            {"choice": "ウ", "verdict": "✗", "explanation": "発生確率と影響度の査定は「リスク分析」のプロセス。対応計画の前の段階で行うよ。"},
            {"choice": "エ", "verdict": "◎ 正解", "explanation": "リスクへの対応計画＝見つけたリスクに対して対策を決めること！「どう対処するか」を計画するプロセスだよ。"}
          ],
          "solvingStrategy": {
            "steps": [
              "リスク管理のプロセスの流れ：特定→分析→対応計画→監視",
              "「対応計画」＝リスクに対する「対策を決める」こと",
              "「対策を決める」という内容の選択肢を見つけよう"
            ],
            "trap": "リスクの洗い出し（特定）や分析と、対応計画を混同しないように注意。対応計画は「リスクがわかった上で、どう対処するか決める」プロセスだよ。"
          }
        }
      ],
      "cardReward": {
        "cardName": "プロジェクトの指揮官",
        "rarity": 1,
        "summary": "プロジェクトマネジメントはプロジェクトを成功に導く管理技術。WBSで作業を細分化し、スコープで範囲を決め、ステークホルダと協力しよう。プロジェクト憲章でスタートを正式に認可するよ！",
        "exp": 100,
        "gold": 200
      }
    }
  ]
}